

/*Трусы-слип, сплошные спереди и сзади. Базовая модель со средней посадкой, подходит к любым бюстгальтерам I like. 
Состав: полиамид 70%, эластан 20% , хлопок 10% (ластовица) .


Трусы с высокой посадкой. Выполнены из эластана, в передней части украшены элегантными кружевными вставками. Задняя часть гладкая. Классическая дамская модель. Подходит к большинству бюстгальтеров "АйЛайк"
Состав 80% полиамид, 20% лайкра

Изящные трусы-слип с бесшовным краем на ягодицах, незаметные под одеждой.

Трусы-слип с кружевом, аналогичным тому, которое  использовано в бюстгальтерах 777 и 777-1.
Спереди кружево, сзади гладкие. 


Классические трусы средней посадки, закрывающие ягодицы. Выполнены из эластичного полотна. Спереди украшены кружевной вставкой, гладкие сзади. 
70% полиамид, 20% эластан, 10% хлопок (ластовица).*/

export const category1 = [
    /** Трусы */
    {
        id: "55041",
        cat: 0,
        brand: 0,
        desc: "Трусы-стринги из хлопковой ткани, кружевные сзади - с бесшовным краем, незаметным под одеждой.",
        img: [
            "/catalog/0/ilike1.jpg",
            "/catalog/0/ilike2.jpg",
            "/catalog/0/ilike3.jpg",
            "/catalog/0/ilike4.png",
            "/catalog/0/ilike5.png",
        ],
        sticker: "ХИТ",
        price: 390,
        count: 20,
        sizes: [
            {size:32, colors:[1,2,3,4,5,6,7,8,9,10,11,12]},
            {size:34, colors:[2,3,4]},
            {size:40, colors:[0,8,9]},
            {size:44, colors:[1,2,3,4,5,6,7,8,9,10,11,12]},
            {size:46, colors:[4,6,8]},
            {size:48, colors:[4,6,8]},
        ]
    },
    {
        id: "55031",
        cat: 0,
        brand: 0,
        desc: "Трусы (хлопок) с высокой посадкой из хлопковой ткани , кружевные сзади - с плоским краем, незаметным под одеждой. Сзади полностью закрывают ягодицы.",
        img: [
            "/catalog/0/ilike2.jpg",
            "/catalog/0/ilike3.jpg",
            "/catalog/0/ilike4.png",
            "/catalog/0/ilike6.png",
            "/catalog/0/ilike7.jpg",
        ],
        sticker: "ХИТ",
        price: 450,
        count: 5,
        sizes: [
            {size:34, colors:[1,4,6,7,8]},
            {size:36, colors:[2,3,10]},
            {size:40, colors:[2,4,8,9]},
            {size:44, colors:[0,4,5]}
        ]
    },
    {
        id: "55048",
        cat: 0,
        brand: 0,
        desc: "Трусы-бразилиана, из хлопковой ткани, кружевные сзади - с бесшовным краем, незаметным под одеждой. ",
        img: ["/catalog/0/ilike3.jpg"],
        sticker: "ХИТ",
        price: 550,
        count: 13,
        sizes: [
            {size:32, colors:[0,7]},
            {size:34, colors:[2,3]},
            {size:36, colors:[4,5,7,9]},
            {size:40, colors:[4,6,9]},
        ]
    },
    {
        id: "54378",
        cat: 0,
        brand: 0,
        desc: "Трусы-слип, сплошные спереди и сзади. Базовая модель со средней посадкой, подходит к любым бюстгальтерам I like ",
        img: ["/catalog/0/ilike4.png"],
        sticker: "ХИТ",
        price: 500,
        count: 13,
        sizes: [
            {size:30, colors:[1,2,4]},
            {size:32, colors:[0,5,8]},
            {size:36, colors:[1,6,7]},
            {size:44, colors:[1,5,8]},
        ]
    },
    {
        id: "25881",
        cat: 0,
        brand: 0,
        desc: "Трусы-бразилиана, из хлопковой ткани, кружевные сзади - с бесшовным краем, незаметным под одеждой. ",
        img: ["/catalog/0/ilike5.png"],
        sticker: "ХИТ",
        price: 480,
        count: 13,
        sizes: [
            {size:38, colors:[0,1,3,5,6,8]},
            {size:40, colors:[9,10]},
            {size:42, colors:[8,9]},
            {size:44, colors:[0,1,9]},
        ]
    },
    {
        id: "29286",
        cat: 0,
        brand: 1,
        desc: "Трусы с высокой посадкой. Выполнены из эластана, в передней части украшены элегантными кружевными вставками. Задняя часть гладкая. Классическая дамская модель. Подходит к большинству бюстгальтеров АйЛайк",
        img: ["/catalog/0/ilike6.png"],
        sticker: "ХИТ",
        price: 410,
        count: 13,
        sizes: [
            {size:36, colors:[1,10,6]},
            {size:38, colors:[1,2,10,14]},
            {size:42, colors:[2,5,10,16]}
        ]
    },
    {
        id: "18136",
        cat: 0,
        brand: 1,
        desc: "Трусы-бразилиана, из хлопковой ткани, кружевные сзади - с бесшовным краем, незаметным под одеждой. ",
        img: ["/catalog/0/ilike7.jpg"],
        sticker: "Новинка",
        price: 450,
        count: 13,
        sizes: [
            {size:32, colors:[0,5,7,]},
            {size:34, colors:[5,6,9,11]},
            {size:36, colors:[0,5,6,8]},
            {size:38, colors:[13,16]},
            {size:40, colors:[0,7,16]},
            {size:54, colors:[0,3,4]},
            {size:58, colors:[0,2,3]}]
    },
    {
        id: "28367",
        cat: 0,
        brand: 1,
        desc: "Трусы-стринги из хлопковой ткани, кружевные сзади - с бесшовным краем, незаметным под одеждой.",
        img: ["/catalog/0/diva1.png"],
        sticker: "ХИТ",
        price: 410,
        count: 20,
        sizes: [
            {size:32, colors:[5,6,7]},
            {size:34, colors:[2,3,5,6,9]},
            {size:36, colors:[0,5,6,8]},
            {size:38, colors:[7,8]},
            {size:40, colors:[0,1,7]},
            {size:54, colors:[0,3,4]},
            {size:58, colors:[0,2,3]}]
    },
    {
        id: "31259",
        cat: 0,
        brand: 8,
        desc: "Изящные трусы-слип с бесшовным краем на ягодицах, незаметные под одеждой.",
        img: ["/catalog/0/diva2.png"],
        sticker: "ХИТ",
        price: 390,
        count: 20,
        sizes: [
            {size:34, colors:[2,3,5,6,9]},
            {size:36, colors:[0,5,6,8]},
            {size:38, colors:[7,8]},
            {size:54, colors:[0,3,4]},
            {size:58, colors:[0,2,3]}]
    },
    {
        id: "32618",
        cat: 0,
        brand: 8,
        desc: "Трусы-стринги из хлопковой ткани, кружевные сзади - с бесшовным краем, незаметным под одеждой.",
        img: ["/catalog/0/diva3.jpg"],
        sticker: "ХИТ",
        price: 470,
        count: 20,
        sizes: [
            {size:32, colors:[0,6,7]},
            {size:36, colors:[0,5,6,8]},
            {size:40, colors:[0,1,7]},
            {size:54, colors:[0,3,4]},
            {size:56, colors:[0,2,3]}]
    },
    {
        id: "32208",
        cat: 0,
        brand: 8,
        desc: "Трусы-слип с кружевом, аналогичным тому, которое  использовано в бюстгальтерах 777 и 777-1. Спереди кружево, сзади гладкие.",
        img: ["/catalog/0/diva3.jpg"],
        sticker: "Новинка",
        price: 470,
        count: 20,
        sizes: [
            {size:32, colors:[0,6,7]},
            {size:36, colors:[0,5,6,8]},
            {size:40, colors:[0,1,7]},
            {size:54, colors:[0,3,4]},
            {size:56, colors:[0,2,3]}]
    },

]
    /*{
        id: "24931",
        cat: 0,
        brand: 8,
        desc: "Трусы-стринги из хлопковой ткани, кружевные сзади - с бесшовным краем, незаметным под одеждой.",
        img: ["/catalog/0/diva4.jpg"],
        sticker: "ХИТ",
        price: 400,
        count: 20,
        sizes: [[38,[0,2,3]],[40,[0,1,3]],[42,[1,3,4]],[44,[0,2,3]]]
    },
    {
        id: "12578",
        cat: 0,
        brand: 8,
        desc: "Трусы-стринги из хлопковой ткани, кружевные сзади - с бесшовным краем, незаметным под одеждой.",
        img: ["/catalog/0/diva5.jpg"],
        sticker: "ХИТ",
        price: 430,
        count: 20,
        sizes: [[38,[0,2,3]],[40,[0,1,3]],[42,[1,3,4]],[44,[0,2,3]]]
    },
    {
        id: "21538",
        cat: 0,
        brand: 4,
        desc: "Трусы-стринги из хлопковой ткани, кружевные сзади - с бесшовным краем, незаметным под одеждой.",
        img: ["/catalog/0/glora1.jpg"],
        sticker: "ХИТ",
        price: 430,
        count: 20,
        sizes: [[38,[0,2,3]],[40,[0,1,3]],[42,[1,3,4]],[44,[0,2,3]]]
    },
    {
        id: "26733",
        cat: 0,
        brand: 4,
        desc: "Трусы-стринги из хлопковой ткани, кружевные сзади - с бесшовным краем, незаметным под одеждой.",
        img: ["/catalog/0/glora2.png"],
        sticker: "ХИТ",
        price: 530,
        count: 20,
        sizes: [[38,[0,2,3]],[40,[0,1,3]],[42,[1,3,4]],[44,[0,2,3]]]
    },
    {
        id: "28593",
        cat: 0,
        brand: 4,
        desc: "Трусы-стринги из хлопковой ткани, кружевные сзади - с бесшовным краем, незаметным под одеждой.",
        img: ["/catalog/0/glora3.png"],
        sticker: "ХИТ",
        price: 380,
        count: 20,
        sizes: [[38,[0,2,3]],[40,[0,1,3]],[42,[1,3,4]],[44,[0,2,3]]]
    },
    {
        id: "63532",
        cat: 0,
        brand: 4,
        desc: "Трусы-стринги из хлопковой ткани, кружевные сзади - с бесшовным краем, незаметным под одеждой.",
        img: ["/catalog/0/glora4.jpg"],
        sticker: "ХИТ",
        price: 440,
        count: 20,
        sizes: [[38,[0,2,3]],[40,[0,1,3]],[42,[1,3,4]],[44,[0,2,3]]]
    },
    {
        id: "31768",
        cat: 0,
        brand: 4,
        desc: "Трусы-стринги из хлопковой ткани, кружевные сзади - с бесшовным краем, незаметным под одеждой.",
        img: ["/catalog/0/glora5.jpg"],
        sticker: "ХИТ",
        price: 480,
        count: 20,
        sizes: [[38,[0,2,3]],[40,[0,1,3]],[42,[1,3,4]],[44,[0,2,3]]]
    },
    {
        id: "21234",
        cat: 0,
        brand: 4,
        desc: "Трусы-стринги из хлопковой ткани, кружевные сзади - с бесшовным краем, незаметным под одеждой.",
        img: ["/catalog/0/glora6.jpeg"],
        sticker: "ХИТ",
        price: 510,
        count: 20,
        sizes: [[38,[0,2,3]],[40,[0,1,3]],[42,[1,3,4]],[44,[0,2,3]]]
    },
    {
        id: "45687",
        cat: 0,
        brand: 1,
        desc: "Трусы-стринги из хлопковой ткани, кружевные сзади - с бесшовным краем, незаметным под одеждой.",
        img: ["/catalog/0/mila1.png"],
        sticker: "ХИТ",
        price: 500,
        count: 20,
        sizes: [[38,[0,2,3]],[40,[0,1,3]],[42,[1,3,4]],[44,[0,2,3]]]
    },
    {
        id: "65387",
        cat: 0,
        brand: 1,
        desc: "Трусы-стринги из хлопковой ткани, кружевные сзади - с бесшовным краем, незаметным под одеждой.",
        img: ["/catalog/0/mila2.jpg"],
        sticker: "ХИТ",
        price: 500,
        count: 20,
        sizes: [[38,[0,2,3]],[40,[0,1,3]],[42,[1,3,4]],[44,[0,2,3]]]
    },
    {
        id: "15622",
        cat: 0,
        brand: 1,
        desc: "Трусы-стринги из хлопковой ткани, кружевные сзади - с бесшовным краем, незаметным под одеждой.",
        img: ["/catalog/0/mila3.jpg"],
        sticker: "ХИТ",
        price: 490,
        count: 20,
        sizes: [[38,[0,2,3]],[40,[0,1,3]],[42,[1,3,4]],[44,[0,2,3]]]
    },
    {
        id: "52352",
        cat: 0,
        brand: 1,
        desc: "Трусы-стринги из хлопковой ткани, кружевные сзади - с бесшовным краем, незаметным под одеждой.",
        img: ["/catalog/0/mila4.jpg"],
        sticker: "ХИТ",
        price: 470,
        count: 20,
        sizes: [[38,[0,2,3]],[40,[0,1,3]],[42,[1,3,4]],[44,[0,2,3]]]
    },
    {
        id: "21569",
        cat: 0,
        brand: 1,
        desc: "Трусы-стринги из хлопковой ткани, кружевные сзади - с бесшовным краем, незаметным под одеждой.",
        img: ["/catalog/0/mila5.jpg"],
        sticker: "ХИТ",
        price: 410,
        count: 20,
        sizes: [[38,[0,2,3]],[40,[0,1,3]],[42,[1,3,4]],[44,[0,2,3]]]
    },



    {  
        id: "0106",
        cat: 1,
        brand: 1,
        desc: "Бюстгальтер из трикотажного и эластичного полотна, без каркасов. Нижняя деталь чашки на х/б подкладке. В чашке использована отделка тесьмой с эффектом «мережки». Комфортная модель, которая отлично поддерживает грудь.",
        img: ["/catalog/1/mila1.png"],
        sticker: "ХИТ",
        price: 670,
        count: 8,
        sizes: [[40,[0,2,3]],[50,[0,1,3]],[52,[1,3,4]],[56,[0,2,3]]]
    },
    {  
        id: "3323",
        cat: 1,
        brand: 1,
        desc: "Изящная и в то же время удобная при носке модель бюстгальтера, выполненная из эластичного принтованного полотна.Чашки на поролоновой основе с подкладкой из х/б трикотажного полотна, в маленьких размерах предусмотрен вкладыш.Наклонный Т-образный рельеф создает оптимальную поддержку груди сбоку и снизу, хорошо удерживает и формирует полную грудь..",
        img: ["/catalog/1/mila2.png"],
        sticker: "ХИТ",
        price: 600,
        count: 21,
        sizes: [[40,[0,2,3]],[50,[0,1,3]],[52,[1,3,4]],[56,[0,2,3]]]
    }, 






    {  
        id: "3221",
        cat: 2,
        brand: 1,
        desc: "Грация сильной степени коррекции без лифа. Корректирует зоны живота, боков, спины  и ягодиц. Вы можете носить с ней тот бюстгальтер, к которому привыкли. Состав - 85% полиэстер, 15% эластан",
        img: ["/catalog/2/mila1.png"],
        sticker: "ХИТ",
        price: 800,
        count: 16,
        sizes: [[40,[0,2,3]],[50,[0,1,3]],[52,[1,3,4]],[56,[0,2,3]]]
    }, 

    {  
        id: "5221",
        cat: 2,
        brand: 1,
        desc: "Грация сильной степени коррекции без лифа. Корректирует зоны живота, боков, спины  и ягодиц. Вы можете носить с ней тот бюстгальтер, к которому привыкли. Состав - 85% полиэстер, 15% эластан",
        img: ["/catalog/2/mila2.png"],
        sticker: "ХИТ",
        price: 740,
        count: 6,
        sizes: [[40,[0,2,3]],[50,[0,1,3]],[52,[1,3,4]],[56,[0,2,3]]]
    }, 
    {  
        id: "9417",
        cat: 2,
        brand: 1,
        desc: "Грация сильной степени коррекции с чашками на полупоролоновой основе. *объем чашки маломерит. Состав - 85% полиэстер, 15% эластан",
        img: ["/catalog/2/mila3.png"],
        sticker: "ХИТ",
        price: 760,
        count: 19,
        sizes: [[40,[0,2,3]],[50,[0,1,3]],[52,[1,3,4]],[56,[0,2,3]]],
    },
    {  
        id: "4267",
        cat: 2,
        brand: 1,
        desc: "Грация сильной степени коррекции без лифа. Корректирует зоны живота, боков, спины  и ягодиц. Вы можете носить с ней тот бюстгальтер, к которому привыкли. Состав - 85% полиэстер, 15% эластан",
        img: ["/catalog/2/mila4.png"],
        sticker: "ХИТ",
        price: 810,
        count: 26,
        sizes: [[40,[0,2,3]],[50,[0,1,3]],[52,[1,3,4]],[56,[0,2,3]]],
    },
    {  
        id: "8447",
        cat: 2,
        brand: 4,
        desc: "Грация сильной степени коррекции с чашками на полупоролоновой основе. *объем чашки маломерит. Состав - 85% полиэстер, 15% эластан",
        img: ["/catalog/2/glora1.png"],
        sticker: "ХИТ",
        price: 750,
        count: 6,
        sizes: [[40,[0,2,3]],[50,[0,1,3]],[52,[1,3,4]],[56,[0,2,3]]],
    },
    {  
        id: "1791",
        cat: 2,
        brand: 2,
        desc: "Грация сильной степени коррекции без лифа. Корректирует зоны живота, боков, спины  и ягодиц. Вы можете носить с ней тот бюстгальтер, к которому привыкли. Состав - 85% полиэстер, 15% эластан",
        img: ["/catalog/2/time1.png"],
        sticker: "ХИТ",
        price: 700,
        count: 7,
        sizes: [[40,[0,2,3]],[50,[0,1,3]],[52,[1,3,4]],[56,[0,2,3]]],
    },
    {  
        id: "2762",
        cat: 2,
        brand: 2,
        desc: "Грация сильной степени коррекции без лифа. Корректирует зоны живота, боков, спины  и ягодиц. Вы можете носить с ней тот бюстгальтер, к которому привыкли. Состав - 85% полиэстер, 15% эластан",
        img: ["/catalog/2/time2.png"],
        sticker: "ХИТ",
        price: 690,
        count: 11,
        sizes: [[40,[0,2,3]],[50,[0,1,3]],[52,[1,3,4]],[56,[0,2,3]]],
    }
]*/
                                           