

export const brandList = [
    "АйЛайк",   //0
    "Милавица", //1
    "Новое время",  //2
    "Биглиф",   //3
    "Глора",    //4
    "Элита",    //5
    "Nuovo vita",   //6
    "Lady Fleur",   //7
    "Дива Шарм",    //8
    "Валерия",  //9
    "Орхидея",  //10
]

export const categoryList = [
"Трусы",
"Бюстгалтеры",
"Грации, Полуграции",
]

/*
"Колготки, рейтузы, панталоны"
"Купальники"
Аксессуары 
Бязь                                   
топы, сорочки, майки, боди
Пижамы женские и мужские,
Полупоролон
Пояса и наколенники                                         
Корректирующее белье
Комбинации, подъюбники
*/


export const ColorName = [
    "белый", //0
    "пион",//1
    "черный",//2
    "красный",//3
    "синий",//4
    "бежевый",//5
    "фуксия",//6
    "т.синий",//7
    "слива",//8
    "сапфир",//9
    "гортензия",//10
    "серый меланж",//11
    "дымчатая роза",//12
    "роза",//13
    "молочный",//14
    "миндаль",//15
    "крокус",//16
    "ультрамарин",//17
]

/*    "черный пион",   
    "черный c красным",    
    "фран.синий",    
    "серый меланж",
    "роза",
    "дымчатая роза",
    "молочный",
    "молоко",
    "миндаль",
    "перец",
    "лотос",
    "туман",
    "фламинго", 
    "крокус",
    "т.виноград",
    "рубин с синим",
    "цветы на белом",
    "ультрамарин",
    "голубой фарфор",*/

export const ColorRGB = [
    "#FFF", // белый
    "#ed9fae", //пион
    "#000", // черный
    "#ff0000ff", //красный
    "#0000ff", //синий
    "#F5F5DC", //бежевый
    "#FF00FF",//фуксия
    "#00008b", //т.синий
    "#660066", //слива
    "#2d5da1", //сапфир
    "#849bcc",//гортензия
    "#CCCAC9",//серый меланж,
    "#f37b94",//дымчатая роза
    "#ff007f",// роза
    "#FDFFF5",// молочный
    "#EED9C4",//миндаль
    "#c67fae",//крокус
    "#120a8f", //ультрамарин
]

/*"черный пион",
    "черный c красным",
    "фран.синий",    
    "перец",
    "лотос",
    "туман",
    "фламинго",
    "т.виноград",
    "рубин с синим",
    "цветы на белом",
    "ультрамарин",
    "голубой фарфор",
*/
import { category1 } from "./category1"



export const category2 = [
    {  
        id: "0106",
        cat: 1,
        brand: 1,
        desc: "Бюстгальтер из трикотажного и эластичного полотна, без каркасов. Нижняя деталь чашки на х/б подкладке. В чашке использована отделка тесьмой с эффектом «мережки». Комфортная модель, которая отлично поддерживает грудь.",
        img: [
            "/catalog/1/mila1.png",
            "/catalog/1/mila2.png"
        ],
        sticker: "ХИТ",
        price: 670,
        count: 8,
         sizes: [{size:32, colors:[1,4,5,6,9]},{size:34, colors:[2,3,5,6,9]},{size:36, colors:[0,5,6,8]},{size:38, colors:[7,8]},{size:40, colors:[0,1,7]},{size:54, colors:[0,3,4]},{size:58, colors:[0,2,3]}]
    },
    {  
        id: "3323",
        cat: 1,
        brand: 1,
        desc: "Изящная и в то же время удобная при носке модель бюстгальтера, выполненная из эластичного принтованного полотна.Чашки на поролоновой основе с подкладкой из х/б трикотажного полотна, в маленьких размерах предусмотрен вкладыш.Наклонный Т-образный рельеф создает оптимальную поддержку груди сбоку и снизу, хорошо удерживает и формирует полную грудь..",
        img: ["/catalog/1/mila2.png"],
        sticker: "ХИТ",
        price: 600,
        count: 21,
         sizes: [{size:32, colors:[1,4,5,6,9]},{size:34, colors:[2,3,5,6,9]},{size:36, colors:[0,5,6,8]},{size:38, colors:[7,8]},{size:40, colors:[0,1,7]},{size:54, colors:[0,3,4]},{size:58, colors:[0,2,3]}]
    }, 

]




export const category3 = [    {  
        id: "3221",
        cat: 2,
        brand: 1,
        desc: "Грация сильной степени коррекции без лифа. Корректирует зоны живота, боков, спины  и ягодиц. Вы можете носить с ней тот бюстгальтер, к которому привыкли. Состав - 85% полиэстер, 15% эластан",
        img: ["/catalog/2/mila1.png"],
        sticker: "ХИТ",
        price: 800,
        count: 16,
        sizes: [
            {size:32, colors:[1,4,5,6,9]},
            {size:34, colors:[2,3,5,6,9]},
            {size:36, colors:[0,5,6,8]},
            {size:46, colors:[7,8]},]
    }, 

    {  
        id: "5221",
        cat: 2,
        brand: 1,
        desc: "Грация сильной степени коррекции без лифа. Корректирует зоны живота, боков, спины  и ягодиц. Вы можете носить с ней тот бюстгальтер, к которому привыкли. Состав - 85% полиэстер, 15% эластан",
        img: ["/catalog/2/mila2.png"],
        sticker: "ХИТ",
        price: 740,
        count: 6,
         sizes: [{size:34, colors:[2,3,5,6,9]},{size:36, colors:[0,5,6,8]},{size:40, colors:[0,1,7]}]
    }, 
    {  
        id: "9417",
        cat: 2,
        brand: 1,
        desc: "Грация сильной степени коррекции с чашками на полупоролоновой основе. *объем чашки маломерит. Состав - 85% полиэстер, 15% эластан",
        img: ["/catalog/2/mila3.png"],
        sticker: "ХИТ",
        price: 760,
        count: 19,
         sizes: [
            {size:32, colors:[1,4,5,6,9]},
            {size:34, colors:[2,3,5,6,9]},
            {size:38, colors:[7,8]},
        ]
    },
    {  
        id: "4267",
        cat: 2,
        brand: 1,
        desc: "Грация сильной степени коррекции без лифа. Корректирует зоны живота, боков, спины  и ягодиц. Вы можете носить с ней тот бюстгальтер, к которому привыкли. Состав - 85% полиэстер, 15% эластан",
        img: ["/catalog/2/mila4.png"],
        sticker: "ХИТ",
        price: 810,
        count: 26,
         sizes: [{size:32, colors:[1,4,5,6,9]},{size:34, colors:[2,3,5,6,9]},{size:36, colors:[0,5,6,8]}]
    },
    {  
        id: "8447",
        cat: 2,
        brand: 4,
        desc: "Грация сильной степени коррекции с чашками на полупоролоновой основе. *объем чашки маломерит. Состав - 85% полиэстер, 15% эластан",
        img: ["/catalog/2/glora1.png"],
        sticker: "ХИТ",
        price: 750,
        count: 6,
         sizes: [{size:40, colors:[0,1,7]},{size:54, colors:[0,3,4]},{size:58, colors:[0,2,3]}]
    },
    {  
        id: "1791",
        cat: 2,
        brand: 2,
        desc: "Грация сильной степени коррекции без лифа. Корректирует зоны живота, боков, спины  и ягодиц. Вы можете носить с ней тот бюстгальтер, к которому привыкли. Состав - 85% полиэстер, 15% эластан",
        img: ["/catalog/2/time1.png"],
        sticker: "ХИТ",
        price: 700,
        count: 7,
         sizes: [{size:44, colors:[0,1,7]},{size:50, colors:[0,3,4]},{size:52, colors:[0,2,3]}]
    },
    {  
        id: "2762",
        cat: 2,
        brand: 2,
        desc: "Грация сильной степени коррекции без лифа. Корректирует зоны живота, боков, спины  и ягодиц. Вы можете носить с ней тот бюстгальтер, к которому привыкли. Состав - 85% полиэстер, 15% эластан",
        img: ["/catalog/2/time2.png"],
        sticker: "ХИТ",
        price: 690,
        count: 11,
        sizes: [{size:52, colors:[0,1,7]},{size:54, colors:[0,3,4]},{size:56, colors:[0,2,3]}]
    }
]
  


export const mockdata = category1.concat(category2).concat(category3)